In [ ]:
# Import the necessary libraries

In [3]:
! pip install numpy

Requirement already satisfied: numpy in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (1.22.4)

WARNING: You are using pip version 21.2.4; however, version 22.1.2 is available.
You should consider upgrading via the 'C:\Users\91938\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [5]:
! pip install seaborn

Collecting seaborn
  Downloading seaborn-0.11.2-py3-none-any.whl (292 kB)
Collecting scipy>=1.0
  Downloading scipy-1.8.1-cp310-cp310-win_amd64.whl (36.9 MB)
Collecting pandas>=0.23
  Downloading pandas-1.4.3-cp310-cp310-win_amd64.whl (10.5 MB)
Requirement already satisfied: numpy>=1.15 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from seaborn) (1.22.4)
Requirement already satisfied: matplotlib>=2.2 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from seaborn) (3.5.2)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (1.4.3)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.7)
Requirement already satisfied: cycler>=0.10 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (9.1.1)
Requirement already satisfied: packaging>=20.0 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (4.33.3)
Collecting pytz>=2020.1
  Downloading pytz-2022.1-py2.py3-none-any.whl (503 kB)
Requirement already satisfied: six>=1.5 in c:\users\91938\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)
Installing collected packages: pytz, scipy, pandas, seaborn
Successfully installed pandas-1.4.3 pytz-2022.1 scipy-1.8.1 seaborn-0.11.2

WARNING: You are using pip version 21.2.4; however, version 22.1.2 is available.
You should consider upgrading via the 'C:\Users\91938\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [6]:
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd

In [10]:
#Import the dataset
user = pd.read_csv(r"C:\Users\91938\OneDrive\Desktop\project\reference.csv")
user.head()

  user_id|age|gender|occupation|zip_code
0                1|24|M|technician|85711
1                     2|53|F|other|94043
2                    3|23|M|writer|32067
3                4|24|M|technician|43537
4                     5|33|F|other|15213

In [11]:
#Assign it to a variable called users and use the 'user_id' as index
user['user_id']=user['user_id|age|gender|occupation|zip_code'].apply(lambda x:x.split('|')[0])
user['age']=user['user_id|age|gender|occupation|zip_code'].apply(lambda x:int(x.split('|')[1]))
user['gender']=user['user_id|age|gender|occupation|zip_code'].apply(lambda x:x.split('|')[2])
user['occupation']=user['user_id|age|gender|occupation|zip_code'].apply(lambda x:x.split('|')[3])
user['zip_code']=user['user_id|age|gender|occupation|zip_code'].apply(lambda x:x.split('|')[4])
user.drop('user_id|age|gender|occupation|zip_code',axis=1,inplace=True)
user.set_index('user_id',inplace=True)
user.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [12]:
#See the first 10 and last 10 entries
print("----------First 10 entries----------")
user.head(10)

----------First 10 entries----------

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [13]:
print("----------Last 10 entries----------")
user.tail(10)

----------Last 10 entries----------

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [14]:
#What is the number of observations in the dataset?
print("Number of observation: ",len(user))

Number of observation:  943

In [15]:
print("Number of columns: ",user.shape[1])

Number of columns:  4

In [16]:
print("Name of all the columns: ",user.columns)

Name of all the columns:  Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [17]:
#How is the dataset indexed?
print(f"Dataset indexed: {user.index}")

Dataset indexed: Index(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10',
       ...
       '934', '935', '936', '937', '938', '939', '940', '941', '942', '943'],
      dtype='object', name='user_id', length=943)

In [18]:
#What is the data type of each column?
print(f"Datatype of each column: {user.info()}")

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB
Datatype of each column: None

In [19]:
#Print only the occupation column
print(f"Occupation of all people:\n {user['occupation']}")

Occupation of all people:
 user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [20]:
#How many different occupations are in this dataset?
print("Total number of occupations are in dataset: ",len(user['occupation'].unique()))

Total number of occupations are in dataset:  21

In [21]:
#What is the most frequent occupation?
print(f"Most frquent occupation:\n {user['occupation'].mode()}")

Most frquent occupation:
 0    student
Name: occupation, dtype: object

In [22]:
#DataFrame Info.
print(f"Dataframe information: {user.info()}")

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB
Dataframe information: None

In [23]:
#Describe all the columns
print(f"Describe all the columns:\n {user.describe()}")

Describe all the columns:
               age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [24]:
#Summarize only the occupation column
print(f"Summary of occupations:\n {user.groupby('occupation')['occupation'].count()}")

Summary of occupations:
 occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: occupation, dtype: int64

In [25]:
#What is the mean age of users?
print("Mean of all users age: ",user['age'].mean())

Mean of all users age:  34.05196182396607

In [26]:
#What is the age with least occurrence?
print(f"Least occurence of age: {user['age'].value_counts().idxmin()}")

Least occurence of age: 7